<h1><center> Data Analysis: Introduction to Pandas </center></h1>

<h2> Part IV. Merging files </h2>

<i>Example 1. Import the necessary libraries</i>

In [3]:
import pandas as pd
import numpy as np

<b>Exercise 1. Create the 3 dictionaries with the given attributes like the followings:</b><br>

|<b></b>|<b></b>|
|---|---|
|<b><center>data1</center></b><img src="data1.png" alt="student" style="width:3cm;height:4cm" />|<b><center>data2</center></b><img src="data2.png" alt="student" style="width:3cm;height:2.5cm" />|
|<b><center>data3</center></b><img src="data3.png" alt="student" style="width:2.25cm;height:3.75cm" />|<b><center>data4</center></b><img src="data4.png" alt="student" style="width:3cm;height:4cm" />|

In [5]:
data1 = {
    "student_id": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "first_name": [
        "Mony", "Nana", "Ray", "Alice", "Ratanak",
        "Nara", "Ratana", "Roth", "Rith", "Johnny"
    ],
    "last_name": [
        "Sopheap", "Tanaka", "Allen", "May", "Sam",
        "Kun", "Vann", "Sovann", "Harrison", "Cole"
    ]
}

data2 = {
    "student_id": [11, 12, 13, 14, 15],
    "first_name": ["John", "Frank", "James", "Tom", "Jennifer"],
    "last_name": ["Bond", "Little", "Collar", "Brune", "Stone"]
}

data3 = {
    "subject_id": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "subject_name": [
        "Math", "Geography", "History", "Literature",
        "Research", "IT", "Moral", "Art",
        "Earth Science", "Physics"
    ]
}

data4 = {
    "student_id": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "subject_id": [1, 3, 7, 8, 5, 4, 2, 7, 1, 6],
    "test_score": [55, 75, 65, 93, 76, 80, 77, 81, 63, 89]
}

<b>Exercise 2. Create the 3 DataFrames from the dictionaries.</b>

In [6]:
data1 = pd.DataFrame(data1)
data2 = pd.DataFrame(data2)
data3 = pd.DataFrame(data3)
data4 = pd.DataFrame(data4)

<b>Exercise 3. Concat data1 and data2 Dataframes placing the data2 under data1.</b>

In [7]:
concat3 = pd.concat([data1, data2], ignore_index=True) #Note: ignore_index=True to reindex the combined DataFrame
concat3

    student_id first_name last_name
0            1       Mony   Sopheap
1            2       Nana    Tanaka
2            3        Ray     Allen
3            4      Alice       May
4            5    Ratanak       Sam
5            6       Nara       Kun
6            7     Ratana      Vann
7            8       Roth    Sovann
8            9       Rith  Harrison
9           10     Johnny      Cole
10          11       John      Bond
11          12      Frank    Little
12          13      James    Collar
13          14        Tom     Brune
14          15   Jennifer     Stone

<b>Exercise 4. Concat data1 and data2 Dataframes placing the data2 on the right side of data1.</b>

In [8]:
concat4 = pd.concat([data1, data2], axis=1)  # axis=1 for horizontal concatenation, axis=0 for vertical concatenation
concat4

   student_id first_name last_name  student_id first_name last_name
0           1       Mony   Sopheap        11.0       John      Bond
1           2       Nana    Tanaka        12.0      Frank    Little
2           3        Ray     Allen        13.0      James    Collar
3           4      Alice       May        14.0        Tom     Brune
4           5    Ratanak       Sam        15.0   Jennifer     Stone
5           6       Nara       Kun         NaN        NaN       NaN
6           7     Ratana      Vann         NaN        NaN       NaN
7           8       Roth    Sovann         NaN        NaN       NaN
8           9       Rith  Harrison         NaN        NaN       NaN
9          10     Johnny      Cole         NaN        NaN       NaN

<b>Exercise 5. Merge the result in <i>Exercise 3</i> with data4 and display the result.</b>

In [15]:
merge_df4 = pd.merge(concat3, data4, on="student_id", how="outer")

#merge with data3 to get subject names
merge_df3 = pd.merge(merge_df4, data3, on="subject_id", how="outer")
merge_df3

    student_id first_name last_name  subject_id  test_score   subject_name
0          1.0       Mony   Sopheap         1.0        55.0           Math
1          9.0       Rith  Harrison         1.0        63.0           Math
2          7.0     Ratana      Vann         2.0        77.0      Geography
3          2.0       Nana    Tanaka         3.0        75.0        History
4          6.0       Nara       Kun         4.0        80.0     Literature
5          5.0    Ratanak       Sam         5.0        76.0       Research
6         10.0     Johnny      Cole         6.0        89.0             IT
7          3.0        Ray     Allen         7.0        65.0          Moral
8          8.0       Roth    Sovann         7.0        81.0          Moral
9          4.0      Alice       May         8.0        93.0            Art
10         NaN        NaN       NaN         9.0         NaN  Earth Science
11         NaN        NaN       NaN        10.0         NaN        Physics
12        11.0       John      Bond         NaN         NaN            NaN
13        12.0      Frank    Little         NaN         NaN            NaN
14        13.0      James    Collar         NaN         NaN            NaN
15        14.0        Tom     Brune         NaN         NaN            NaN
16        15.0   Jennifer     Stone         NaN         NaN            NaN

<b>Exercise 6. How many points does Johnny Cole get in the test? Display the information, score and subjects of Johnny Cole.</b>

In [10]:
johnny_cole = merge_df3[
    (merge_df3['first_name'] == 'Johnny') &
    (merge_df3['last_name'] == 'Cole')
]
johnny_cole
johnny_cole_point = johnny_cole['test_score'].iloc[0]
print(johnny_cole)
print("Johnny Cole's test score:", johnny_cole_point)

   student_id first_name last_name  subject_id  test_score subject_name
9          10     Johnny      Cole           6          89           IT
Johnny Cole's test score: 89

<b>Exercise 7. Which subject does Nara Kun take the test on? Display the information, score and subjects of Nara Kun.

In [11]:
Nara_kun = merge_df3[(merge_df3['first_name'] == 'Nara') & (merge_df3['last_name'] == 'Kun')]
Nara_kun
Nara_kun_sub = Nara_kun['subject_name'].iloc[0]
print(Nara_kun)
print("Nara Kun's subject name is:", Nara_kun_sub)

   student_id first_name last_name  subject_id  test_score subject_name
5           6       Nara       Kun           4          80   Literature
Nara Kun's subject name is: Literature

<b>Exercise 8. Which subject does Mony Sopheak and James Collar take the test on? Display the information, score and subjects of the two students.

In [30]:
result = merge_df3[
    ((merge_df3["first_name"] == "Mony") & (merge_df3["last_name"] == "Sopheap")) |
    ((merge_df3["first_name"] == "James") & (merge_df3["last_name"] == "Collar"))
]

result_mony_subject = result['subject_name'].iloc[0]
result_james_subject = result['subject_name'].iloc[1]
print(result)
print("Mony Sopheap's subject name is:", result_mony_subject, "and James Collar's subject name is:", result_james_subject)

    student_id first_name last_name  subject_id  test_score subject_name
0          1.0       Mony   Sopheap         1.0        55.0         Math
14        13.0      James    Collar         NaN         NaN          NaN
Mony Sopheap's subject name is: Math and James Collar's subject name is: nan